#encoding=utf-8

import argparse

parser = argparse.ArgumentParser()


text = '''广东西边有个叫孙子楚的人，是个名士。他生来有六个手指，性格憨厚，口齿迟钝。别人骗他，他都信以为真，有时遇到座席上有歌妓在，他远远地看见转身便走了。别人知道他有这种脾气，就把他骗来，让妓女挑逗逼迫他，他就羞得脸一直红到脖子，汗珠直往下淌。大家因此而笑话他，形容他呆痴的样子，到处传说，并给他起了一个难听的外号“孙痴”。
    本县有个大商人某翁，可与王侯比富，他的亲戚都是有钱有势的人家。大富商有个女儿叫阿宝，长得非常漂亮，她父母正忙着为她挑选佳婿。许多名门贵族的子弟争着来求亲，商人都没看中。正巧孙子楚的妻子死了，有人捉弄他，劝他到大富商家提亲。孙子楚也没想想自己的情况，竟托媒人去了。商人也知道孙子楚的名字，但嫌他太穷没答应。媒人要离开的时候，正好遇上阿宝。阿宝问什么事，媒人讲了来意，阿宝便开玩笑地说：“他如能把那个多余的指头砍了，我就嫁给他。”媒婆把这话告诉了孙子楚。孙自言道：“这不难。”媒婆走后，孙子楚便用斧头把第六个指头剁去了，血流如注，痛得他几乎死了过去。过了几天，刚能起床，便到媒婆家把已剁掉六指的手给她看。媒婆吓了一跳，忙去富商家告诉了阿宝。阿宝也很惊奇，又开了个玩笑说孙子楚还得去掉那个痴劲才行。孙子楚听后大声辩解，说自己并不痴呆，然而却没有机会当面向阿宝表白。转念一想，阿宝也未必美如天仙，何必把自己的身价抬那么高。因此求亲的念头也就凉了下来。
    正好清明节到了，按风俗这一天是妇女们到郊外踏青的日子。一些轻薄少年也结伴同行，对妇女们评头论足，随意调笑。有几个文朋诗友也硬把孙子楚拉去了，有的嘲笑他说：“不想看看你那可意的美人吗？”孙子楚知道大家在戏弄自己，但因为受了阿宝的嘲弄，也想见见阿宝是个什么样的人，所以便欣然随大家边走边看。远远地见一个女子在树下歇息，一群恶少把她围得像一堵墙似的。朋友们说：“这一定是阿宝了。”跑过去一看，果然是阿宝。仔细看真是美丽无比，十分动人。一会儿，围观的人越来越多，阿宝急忙起身走了。众人神魂颠倒，评头论足，简直要发狂了，唯有孙子楚默默无语。大家都走开了，可回头一看，孙子楚仍然呆呆地站在那儿，喊他也不答应。大家来拉他说：“魂随阿宝去了吗？”孙子楚还是不说话。大家因为他平时就呆板少语，也不奇怪。有人推着他，有人拉着他，回家去了。
    孙子楚到家后，一头倒在床上。整天昏睡不起，像醉了一样，喊也喊不醒。家里人以为他丢了魂，到野外给他叫魂也不见效。用劲拍打着问他，他才含糊朦胧地说：“我在阿宝家。”再细问他时，又默默无语了。家里人心里害怕，也不知是怎么回事。

    当初，孙子楚见阿宝走了，心里非常难舍，觉得自己的身子也跟她走了，渐渐地靠在了她的衣带上，也没有人呵斥她。于是跟阿宝回了家。坐着躺着都和阿宝在一起，到了夜里便与阿宝交欢，很是亲热欢治。可就是觉得肚子里特别饿，想回家一趟，却不认得回家的路。阿宝每每梦到与人交合，问他的名字，都是说：“我是孙子楚。”阿宝心里很奇怪，可也不便告诉别人。
    孙子楚躺了三天，眼看就要断气了，家里人又急又怕，就托人到商人家里恳求给孙子楚招魂。商人笑着说：“平时素无往来，怎么会把魂丢在我家呢？”孙家哀求不已，商人才答应了。巫婆拿着孙子楚的旧衣服、草席子来到商人家。阿宝知道了来意后，害怕极了，她不让巫婆到别处去，直接把巫婆带到自已房中，任凭巫婆招呼一番后离去了。巫婆刚回到孙家门口，屋内床上的孙子楚已经呻吟起来。醒后，他还能清清楚楚地说出阿宝室内摆设用具的名字和颜色，一点不错。阿宝听说后，更加害怕了，但心里也感到了孙子楚的情义之深。
    孙子楚能起床后，不论坐着，还是站着，总是若有所思，精神恍惚，好像丢了什么。常打听阿宝的消息，盼望能再见到阿宝。浴佛节那天，听说阿宝将要到水月寺烧香，孙子楚一早就去在路旁等候，直看得头晕眼花，到中午阿宝才来。阿宝从车里看到了孙子楚，用纤手撩起帘子目不转睛地注视着他。孙子楚更加动了情，就在后面跟着走。阿宝忽然让丫鬟来问他的姓名。孙子楚很殷勘地说了，更加魂魄摇荡，直到车走了以后，他才回家。
    孙子楚回家后，旧病复发，不吃不喝，昏睡中喊着阿宝的名字，直恨自己的灵魂不能再像上次那样到阿宝的家里去。他家中养了一只鹦鹉，这时突然死了，小孩子拿着在床边玩。孙子楚看见了心想，我如果能变成鹦鹉，展翅就可飞到阿宝的房里了。心里正想着，身子果然已变成了一只鹦鹉，翩然飞了出去，一直飞到了阿宝的房中。阿宝高兴地捉住它，将它的腿用绳子绑住，用麻籽喂它。鹦鹉忽然口吐人声说：“姐姐别绑我，我是孙子楚啊！”阿宝吓了一跳，忙解开绳子，鹦鹉也不飞走。阿宝对着鹦鹉祷告说：“你的深情已铭刻在我心中。现在我们人禽不同类，良姻怎么能复圆呢？”鹦鹉说：“能在你的身边，我的心愿已经满足了。”其它人喂它它不吃，只有阿宝喂它，它才肯吃。阿宝坐下，鹦鹉就蹲在她的膝上；阿宝躺下，鹦鹉就偎在她的身边。这样过了三天，阿宝很可怜它，就悄悄派人去察看孙子楚。见孙子楚僵卧在床上已断气三天了，只是心口窝还有点温暖。阿宝又祷告说：“你要是能重新变成人，我就是死也要与你相伴。”鹦鹉说：“你骗我！”阿宝立刻发起誓来。鹦鹉斜着眼睛，好像在思索什么。一会儿，阿宝裹脚，把鞋脱到床下，鹦鹉猛地冲下，用嘴叼起鞋来飞走了。阿宝急忙呼叫它，鹦鹉已经飞远了。阿宝派个老妈妈前去探望，孙子楚果然已经醒过来了。

    孙家的人见鹦鹉叼来一只绣鞋，便落地死了，正感到奇怪，孙子楚已醒来。刚醒就开始找鞋，大家都不知道是怎么回事。正好阿宝家的老妈妈赶到。进房看到孙子楚，就问他鞋在哪里。孙子楚说：“鞋是阿宝发誓的信物，请你代我转告，我孙子楚不会忘记她金子般的诺言。”老妈妈回来把话照榉说了一遍，阿宝更是奇怪，便让丫鬟把这些事故意泄露给自己的母亲。母亲又详细询问明白后才说：“孙子楚这个人还是有才学的，名声也不错，但却像司马相如一样贫寒。选了几年的女婿，最后得到的竟是这样的，恐怕会被显贵们笑话。”阿宝因为鞋的缘故，不肯他嫁，父母只好听了她的。有人跑去告诉孙子楚这个消息，孙子楚非常高兴，病立刻全好了。
    阿宝的父母想把孙子楚招赘过来。阿宝说：“女婿不应该长住在岳父家里。何况他家又贫穷，住长了会让人家瞧不起。女儿既然已经答应了他，住草屋、吃粗饭决无怨言。”孙子楚于是去迎娶新娘成婚，两人相见如隔世的夫妻又团圆了一样高兴。
    自此以后，孙子楚家有了阿宝的嫁妆，增加了财物家产，生活有了好转。孙子楚只是迷在书里，不知道治家理财。阿宝是个善于当家过日子的人，家中诸事都不用孙子楚操心。过了三年，家中更富了。可孙子楚忽然得热病死了。阿宝哭得非常悲痛，眼里的泪水始终没有干过，觉也不睡，饭也不吃，谁劝也不听，乘夜里上吊了。丫鬟发现后，急忙救护，才醒了过来，可总也不吃东西。三天后，家人召集亲友，准备给孙子楚送葬。听到棺材里传出呻吟之声，打开一看，孙子楚复活了。自己说是：“见到了阎王，阎王说我这个人生平朴实诚恳，命令我当了部曹。忽然有人说：‘孙部曹的妻子将要到了。’阎王查了生死簿，说：‘她还不到死的时候。’又有人说：‘已经三天不吃饭了。’阎王回身说：‘你妻子的节义行为感动了我，让你再生阳世吧。’于是就派马夫牵着马把我送了回来。”
    从此以后，孙子楚身体渐渐恢复了正常。这年适逢乡试，进考场之前，一群少年戏弄孙子楚，一起拟了七个偏怪的试题，把孙子楚骗到僻静之处，说：“这是有人通过关系得到的试题，因咱们友好才偷偷地告诉你。”孙子楚信以为真，黑天白日地琢磨，准备好了七篇八股文。大家都暗暗地笑他。当时主考官考虑到用过去的题目会有抄袭之弊，有意地一反常规，试题发下来，竟与孙子楚准备的七题一模一样，孙子楚中了乡试头名。第二年又中了进士，进了翰林院。皇上听说了孙子楚这些怪事，把他召来询问，孙子楚全都如实地奏明了。皇上非常称赞和高兴。后又召见阿宝，赏赐了很多东西。 '''














count = 0
out = ''
for c in text:
    if c == '\n':
        count = 0
    else:
        count += 1
    if count > 36:
        out += '\n'
        out += c
        count = 0
    else:
        out += c

print(out)
